Analise de Dados

In [1]:
!pip install pandas -q

In [2]:
import pandas as pd

In [3]:
# Lendo o arquivo .csv (Necessita falar o destinatario do arquivo)

dados = pd.read_csv('./vendas.csv', sep= ';')

In [4]:
print(type(vd))

NameError: name 'vd' is not defined

In [ ]:
dados

,ID_Pedido,Data_Compra,Cliente_ID,Valor_Total,Categoria_Produto,Quantidade
0,1001,2024-03-01,501,150.75,Eletrônicos,1
1,1002,2024-03-02,502,200.50,Roupas,3
2,1003,2024-03-03,503,320.00,Casa,2
3,1004,2024-03-04,501,90.25,Eletrônicos,1
4,1005,2024-03-05,504,450.60,Esportes,4

# Analise Exploratoria

Trata-se do reconhecimento inicial dos dados presentes no dataset.

In [ ]:
# Visualizar as linhas iniciais do dataset

dados.head()

,ID_Pedido,Data_Compra,Cliente_ID,Valor_Total,Categoria_Produto,Quantidade
0,1001,2024-03-01,501,150.75,Eletrônicos,1
1,1002,2024-03-02,502,200.50,Roupas,3
2,1003,2024-03-03,503,320.00,Casa,2
3,1004,2024-03-04,501,90.25,Eletrônicos,1
4,1005,2024-03-05,504,450.60,Esportes,4

In [ ]:
# Verificar as linhas finais do dataset

dados.tail()

,ID_Pedido,Data_Compra,Cliente_ID,Valor_Total,Categoria_Produto,Quantidade
0,1001,2024-03-01,501,150.75,Eletrônicos,1
1,1002,2024-03-02,502,200.50,Roupas,3
2,1003,2024-03-03,503,320.00,Casa,2
3,1004,2024-03-04,501,90.25,Eletrônicos,1
4,1005,2024-03-05,504,450.60,Esportes,4

In [ ]:
# Mostra a quantidade de linhas e a quantidade de series(colunas)

dados.shape

(5, 6)

In [ ]:
dados.describe()

         ID_Pedido  Cliente_ID  Valor_Total  Quantidade
count     5.000000     5.00000     5.000000     5.00000
mean   1003.000000   502.20000   242.420000     2.20000
std       1.581139     1.30384   143.765393     1.30384
min    1001.000000   501.00000    90.250000     1.00000
25%    1002.000000   501.00000   150.750000     1.00000
50%    1003.000000   502.00000   200.500000     2.00000
75%    1004.000000   503.00000   320.000000     3.00000
max    1005.000000   504.00000   450.600000     4.00000

In [ ]:
variancia = dados['Valor_Total'].var()
mediana = dados ['Valor_Total'].median()

print(f'Variancia:{variancia}')
print(f'Mediana:{mediana}')

Variancia:20668.488250000002
Mediana:200.5

In [ ]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID_Pedido          5 non-null      int64
 1   Data_Compra        5 non-null      object
 2   Cliente_ID         5 non-null      int64
 3   Valor_Total        5 non-null      float64
 4   Categoria_Produto  5 non-null      object
 5   Quantidade         5 non-null      int64
dtypes: float64(1), int64(3), object(2)
memory usage: 372.0+ bytes

In [ ]:
dados['Categoria_Produto'].unique()

array(['Eletrônicos', 'Roupas', 'Casa', 'Esportes'], dtype=object)

In [ ]:
dados['Categoria_Produto'].value_counts()

Categoria_Produto
Eletrônicos    2
Roupas         1
Casa           1
Esportes       1
Name: count, dtype: int64

In [ ]:
# Visualizar nomes das colunas
dados.columns

Index(['ID_Pedido', 'Data_Compra', 'Cliente_ID', 'Valor_Total',
       'Categoria_Produto', 'Quantidade'],
      dtype='object')

In [ ]:
dados.rename(columns={'Data_Compra':'dt_compra',
                      'Categoria_Produto':'categoria'
                     })

   ID_Pedido   dt_compra  Cliente_ID  Valor_Total    categoria  Quantidade
0       1001  2024-03-01         501       150.75  Eletrônicos           1
1       1002  2024-03-02         502       200.50       Roupas           3
2       1003  2024-03-03         503       320.00         Casa           2
3       1004  2024-03-04         501        90.25  Eletrônicos           1
4       1005  2024-03-05         504       450.60     Esportes           4

In [ ]:
colunas = ['pedido','data','cliente','valor','categoria','qtd']

dados.columns = colunas

dados

   pedido        data  cliente   valor    categoria  qtd
0    1001  2024-03-01      501  150.75  Eletrônicos    1
1    1002  2024-03-02      502  200.50       Roupas    3
2    1003  2024-03-03      503  320.00         Casa    2
3    1004  2024-03-04      501   90.25  Eletrônicos    1
4    1005  2024-03-05      504  450.60     Esportes    4

In [ ]:
colunas_maiusculas = []

for coluna in list(dados.columns):
    colunas_maiusculas.append(coluna.upper())

dados.columns = colunas_maiusculas

dados

   PEDIDO        DATA  CLIENTE   VALOR    CATEGORIA  QTD
0    1001  2024-03-01      501  150.75  Eletrônicos    1
1    1002  2024-03-02      502  200.50       Roupas    3
2    1003  2024-03-03      503  320.00         Casa    2
3    1004  2024-03-04      501   90.25  Eletrônicos    1
4    1005  2024-03-05      504  450.60     Esportes    4